In [1]:
# Biblioteca para modelagem de dados
import pandas as pd

# Biblioteca para recursos matemáticos
import numpy as np

# Biblioteca para plotagem de dados
import matplotlib.pyplot as plt

In [2]:
# Lista com os rotulos
Labels = ['1º', '2º', '3º', '4º', '5º']

# Lista com os valores
Valores = [1, 3, 5, 7, 9]

# Criando a base de dados com as listas
Serie = pd.Series( data=Valores, index=Labels )
Serie

1º    1
2º    3
3º    5
4º    7
5º    9
dtype: int64

In [3]:
#Acessando um valor da base de dados
Serie['5º']

9

In [4]:
# Multiplicando
Serie * 2

1º     2
2º     6
3º    10
4º    14
5º    18
dtype: int64

In [5]:
#Criando nova base de dados
Serie_Nova = pd.Series( data=[50,100,150, 200, 250], index=Labels )

#Adicionar os valores da primeira com os da segunda, de acordo a ordem na lista
Serie + Serie_Nova

1º     51
2º    103
3º    155
4º    207
5º    259
dtype: int64

In [6]:
# Criando um dicionário
Dicionario = {
    'A' : [1, 2, 3, 4],
    'B' : [-3, -2, -1, 0],
    'C' : [0, 10, 20, 35], 
    'D' : [100, 250, 525, 35] }

# Criando uma lista com os labels
Label = ['Linha 1', 'Linha 2', 'Linha 3', 'Linha 4']

DataFrame_01 = pd.DataFrame( Dicionario, index=Label )
DataFrame_01

         A  B   C    D
Linha 1  1 -3   0  100
Linha 2  2 -2  10  250
Linha 3  3 -1  20  525
Linha 4  4  0  35   35

In [7]:
#Acessar um valor do dataframe
DataFrame_01['C']

Linha 1     0
Linha 2    10
Linha 3    20
Linha 4    35
Name: C, dtype: int64

In [8]:
#Acessar mais de um registo do dataframe
DataFrame_01[['A', 'B', 'D']]

         A  B    D
Linha 1  1 -3  100
Linha 2  2 -2  250
Linha 3  3 -1  525
Linha 4  4  0   35

In [9]:
#Criando nova coluna
DataFrame_01['Nova_Coluna'] = DataFrame_01['A'] * DataFrame_01['B']
DataFrame_01

         A  B   C    D  Nova_Coluna
Linha 1  1 -3   0  100           -3
Linha 2  2 -2  10  250           -4
Linha 3  3 -1  20  525           -3
Linha 4  4  0  35   35            0

In [10]:
#Deletar uma coluna
DataFrame_01.drop('Nova_Coluna', axis=1, inplace=True)
DataFrame_01

         A  B   C    D
Linha 1  1 -3   0  100
Linha 2  2 -2  10  250
Linha 3  3 -1  20  525
Linha 4  4  0  35   35

In [11]:
#Acessar ao valor de uma linha
DataFrame_01.loc['Linha 1']

A      1
B     -3
C      0
D    100
Name: Linha 1, dtype: int64

In [12]:
#Acessar valor de linhas e colunas
DataFrame_01.loc[['Linha 1','Linha 3' ], ['A', 'C']]

         A   C
Linha 1  1   0
Linha 3  3  20

In [13]:
#Acessar valores de linhas e colunas pela posicao
DataFrame_01.iloc[0:3, 0:]

         A  B   C    D
Linha 1  1 -3   0  100
Linha 2  2 -2  10  250
Linha 3  3 -1  20  525

In [14]:
#Buscar dados no dataframe que são maiores que zero 0
DataFrame_01 > 0

            A      B      C     D
Linha 1  True  False  False  True
Linha 2  True  False   True  True
Linha 3  True  False   True  True
Linha 4  True  False   True  True

In [15]:
DataFrame_01[ DataFrame_01['D'] > 0 ]['C']

Linha 1     0
Linha 2    10
Linha 3    20
Linha 4    35
Name: C, dtype: int64

In [16]:
Filtro = DataFrame_01['C'] > 0
DataFrame_02 = DataFrame_01[Filtro]
DataFrame_02['A']

Linha 2    2
Linha 3    3
Linha 4    4
Name: A, dtype: int64

In [17]:
DataFrame_01[
  ( DataFrame_01['A'] > 1 ) & ( DataFrame_01['C'] > 0 )
]

         A  B   C    D
Linha 2  2 -2  10  250
Linha 3  3 -1  20  525
Linha 4  4  0  35   35

In [18]:
DataFrame_01.reset_index()

     index  A  B   C    D
0  Linha 1  1 -3   0  100
1  Linha 2  2 -2  10  250
2  Linha 3  3 -1  20  525
3  Linha 4  4  0  35   35

In [19]:
DataFrame_01

         A  B   C    D
Linha 1  1 -3   0  100
Linha 2  2 -2  10  250
Linha 3  3 -1  20  525
Linha 4  4  0  35   35

In [20]:
# Criando varios dicionarios
Dicionario_01 = {'A' : [1, 2, 3], 
                 'B' : [-32, -21, -15], 
                 'C' : [60, 10, 20],
                 'Chave' : ['AA', 'BB', 'CC'] }

Dicionario_02 = {'A' : [6, 7, 8], 
                 'B' : [-39, -28, -17], 
                 'C' : [1000, 10, 60],
                 'Chave' : ['AA', 'BB', 'CC'] }

Dicionario_03 = {'A' : [11, 12, 13], 
                 'B' : [-39, -22, -11], 
                 'C' : [30, 10, 20],
                 'Chave' : ['AA', 'BB', 'CC'] }

# Criando varias listas para serem os labels
Label_01 = ['1º Linha', '2º Linha', '3º Linha']
Label_02 = ['4º Linha', '5º Linha', '6º Linha']
Label_03 = ['7º Linha', '8º Linha', '9º Linha']

# Estruturando as bases de dados
DataFrame_01 = pd.DataFrame( Dicionario_01, index=Label_01 )
DataFrame_02 = pd.DataFrame( Dicionario_02, index=Label_02 )
DataFrame_03 = pd.DataFrame( Dicionario_03, index=Label_03 )

In [21]:
DataFrame_01, DataFrame_02, DataFrame_03

(          A   B   C Chave
 1º Linha  1 -32  60    AA
 2º Linha  2 -21  10    BB
 3º Linha  3 -15  20    CC,
           A   B     C Chave
 4º Linha  6 -39  1000    AA
 5º Linha  7 -28    10    BB
 6º Linha  8 -17    60    CC,
            A   B   C Chave
 7º Linha  11 -39  30    AA
 8º Linha  12 -22  10    BB
 9º Linha  13 -11  20    CC)

In [22]:
pd.concat(
  [ DataFrame_01, DataFrame_02, DataFrame_03 ]
)

           A   B     C Chave
1º Linha   1 -32    60    AA
2º Linha   2 -21    10    BB
3º Linha   3 -15    20    CC
4º Linha   6 -39  1000    AA
5º Linha   7 -28    10    BB
6º Linha   8 -17    60    CC
7º Linha  11 -39    30    AA
8º Linha  12 -22    10    BB
9º Linha  13 -11    20    CC

In [23]:
pd.merge(
  DataFrame_01, DataFrame_02, how='inner', on='Chave'
)

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [24]:
# Criando varios dicionarios
Dicionario_01 = {'A' : [1, 2, 3], 
                 'B' : [-32, -21, -15], 
                 'C' : [60, 10, 20] }

Dicionario_02 = {'D' : [6, 7, 8], 
                 'E' : [-39, -28, -17], 
                 'F' : [1000, 10, 60] }

# Criando varias listas para serem os labels
Label_01 = ['1º Linha', '2º Linha', '3º Linha']


# Estruturando as bases de dados
DataFrame_01 = pd.DataFrame( Dicionario_01, index=Label_01 )
DataFrame_02 = pd.DataFrame( Dicionario_02, index=Label_01 )

# Aplicando a função join
DataFrame_01.join(DataFrame_02)

          A   B   C  D   E     F
1º Linha  1 -32  60  6 -39  1000
2º Linha  2 -21  10  7 -28    10
3º Linha  3 -15  20  8 -17    60

In [25]:
Dados = pd.Series( [1,3,5,np.nan,6,8] )
Dados

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [26]:
Lista_Datas = pd.date_range('20210101', periods=5)
Lista_Datas

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05'],
              dtype='datetime64[ns]', freq='D')

In [27]:
DataFrame_01 = pd.DataFrame( np.random.randn(5,4), 
                  index=Lista_Datas, 
                  columns=list( ['A','B','C','D']) )
DataFrame_01

                   A         B         C         D
2021-01-01  0.276618  0.091495 -1.155843 -0.636452
2021-01-02  0.811114  0.088884 -0.358460 -0.341048
2021-01-03  0.755415  0.797776 -0.440897  0.670351
2021-01-04  1.752075  0.647695  0.479490  0.175780
2021-01-05  1.322530  0.382532  1.591827 -0.016956

In [28]:
Dicionario = {
    'A' : 1,
    'B' : pd.Timestamp('20210102'),
    'C' : pd.Series(1, index=list(range(4)), dtype='float32'),
    'D' : np.array([3] * 4, dtype='int32'),
    'E' : pd.Categorical( ["Email", "Telefone", "Celular", "País"] ),
    'F' : pd.Categorical( ["email@.email.com", "(11)4455-4455", "(11)922332233", "Brasil"] ),
}

DataFrame_02 = pd.DataFrame( Dicionario )
DataFrame_02

   A          B    C  D         E                 F
0  1 2021-01-02  1.0  3     Email  email@.email.com
1  1 2021-01-02  1.0  3  Telefone     (11)4455-4455
2  1 2021-01-02  1.0  3   Celular     (11)922332233
3  1 2021-01-02  1.0  3      País            Brasil

In [29]:
#Verificar o tipo de dados das colunas
DataFrame_02.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F          category
dtype: object

In [30]:
#Ver as primeiras colunas do dataframe usando o head()
DataFrame_02.head()

   A          B    C  D         E                 F
0  1 2021-01-02  1.0  3     Email  email@.email.com
1  1 2021-01-02  1.0  3  Telefone     (11)4455-4455
2  1 2021-01-02  1.0  3   Celular     (11)922332233
3  1 2021-01-02  1.0  3      País            Brasil

In [31]:
#Ver as ultimas colunas do dataframe usando o tail()
DataFrame_02.tail(2)

   A          B    C  D        E              F
2  1 2021-01-02  1.0  3  Celular  (11)922332233
3  1 2021-01-02  1.0  3     País         Brasil

In [32]:
DataFrame_02.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [33]:
DataFrame_02.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [34]:
DataFrame_02.values

array([[1, Timestamp('2021-01-02 00:00:00'), 1.0, 3, 'Email',
        'email@.email.com'],
       [1, Timestamp('2021-01-02 00:00:00'), 1.0, 3, 'Telefone',
        '(11)4455-4455'],
       [1, Timestamp('2021-01-02 00:00:00'), 1.0, 3, 'Celular',
        '(11)922332233'],
       [1, Timestamp('2021-01-02 00:00:00'), 1.0, 3, 'País', 'Brasil']],
      dtype=object)

In [35]:
DataFrame_02.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [36]:
DataFrame_01.sort_index(axis=1, ascending=False)

                   D         C         B         A
2021-01-01 -0.636452 -1.155843  0.091495  0.276618
2021-01-02 -0.341048 -0.358460  0.088884  0.811114
2021-01-03  0.670351 -0.440897  0.797776  0.755415
2021-01-04  0.175780  0.479490  0.647695  1.752075
2021-01-05 -0.016956  1.591827  0.382532  1.322530

In [37]:
DataFrame_02.sort_values(by='E')

   A          B    C  D         E                 F
2  1 2021-01-02  1.0  3   Celular     (11)922332233
0  1 2021-01-02  1.0  3     Email  email@.email.com
3  1 2021-01-02  1.0  3      País            Brasil
1  1 2021-01-02  1.0  3  Telefone     (11)4455-4455

In [38]:
DataFrame_01['A']

2021-01-01    0.276618
2021-01-02    0.811114
2021-01-03    0.755415
2021-01-04    1.752075
2021-01-05    1.322530
Freq: D, Name: A, dtype: float64

In [39]:
DataFrame_01[0:3]

                   A         B         C         D
2021-01-01  0.276618  0.091495 -1.155843 -0.636452
2021-01-02  0.811114  0.088884 -0.358460 -0.341048
2021-01-03  0.755415  0.797776 -0.440897  0.670351

In [40]:
DataFrame_01['20210101':'20210102']

                   A         B         C         D
2021-01-01  0.276618  0.091495 -1.155843 -0.636452
2021-01-02  0.811114  0.088884 -0.358460 -0.341048

In [41]:
DataFrame_01.loc['20210101']

A    0.276618
B    0.091495
C   -1.155843
D   -0.636452
Name: 2021-01-01 00:00:00, dtype: float64

In [42]:
DataFrame_01.loc[:,['A','B']]

                   A         B
2021-01-01  0.276618  0.091495
2021-01-02  0.811114  0.088884
2021-01-03  0.755415  0.797776
2021-01-04  1.752075  0.647695
2021-01-05  1.322530  0.382532

In [43]:
DataFrame_01.iloc[3]

A    1.752075
B    0.647695
C    0.479490
D    0.175780
Name: 2021-01-04 00:00:00, dtype: float64

In [44]:
DataFrame_01.iloc[3:5,0:2]

                   A         B
2021-01-04  1.752075  0.647695
2021-01-05  1.322530  0.382532

In [45]:
DataFrame_01[ DataFrame_01.A > 0 ]

                   A         B         C         D
2021-01-01  0.276618  0.091495 -1.155843 -0.636452
2021-01-02  0.811114  0.088884 -0.358460 -0.341048
2021-01-03  0.755415  0.797776 -0.440897  0.670351
2021-01-04  1.752075  0.647695  0.479490  0.175780
2021-01-05  1.322530  0.382532  1.591827 -0.016956

In [46]:
DataFrame_01[ DataFrame_01 > 0 ]

                   A         B         C         D
2021-01-01  0.276618  0.091495       NaN       NaN
2021-01-02  0.811114  0.088884       NaN       NaN
2021-01-03  0.755415  0.797776       NaN  0.670351
2021-01-04  1.752075  0.647695  0.479490  0.175780
2021-01-05  1.322530  0.382532  1.591827       NaN

In [47]:
DataFrame_03 = DataFrame_01.copy()
DataFrame_03

                   A         B         C         D
2021-01-01  0.276618  0.091495 -1.155843 -0.636452
2021-01-02  0.811114  0.088884 -0.358460 -0.341048
2021-01-03  0.755415  0.797776 -0.440897  0.670351
2021-01-04  1.752075  0.647695  0.479490  0.175780
2021-01-05  1.322530  0.382532  1.591827 -0.016956

In [48]:
DataFrame_03['Nova_Coluna'] = ['abc', 'def', 'ghi', 'jkl', 'mno']
DataFrame_03

                   A         B         C         D Nova_Coluna
2021-01-01  0.276618  0.091495 -1.155843 -0.636452         abc
2021-01-02  0.811114  0.088884 -0.358460 -0.341048         def
2021-01-03  0.755415  0.797776 -0.440897  0.670351         ghi
2021-01-04  1.752075  0.647695  0.479490  0.175780         jkl
2021-01-05  1.322530  0.382532  1.591827 -0.016956         mno

In [49]:
DataFrame_03[ DataFrame_03['Nova_Coluna'].isin(['abc', 'mno']) ]

                   A         B         C         D Nova_Coluna
2021-01-01  0.276618  0.091495 -1.155843 -0.636452         abc
2021-01-05  1.322530  0.382532  1.591827 -0.016956         mno

In [50]:
DataFrame_04 = pd.Series( [1,2,3,4,5,6], 
                          index=pd.date_range('20210101', periods=6) )
DataFrame_04

2021-01-01    1
2021-01-02    2
2021-01-03    3
2021-01-04    4
2021-01-05    5
2021-01-06    6
Freq: D, dtype: int64

In [51]:
DataFrame_04.at[ dates[0], 'A'] = 0

NameError: name 'dates' is not defined

In [ ]:
Lista = [ c for c in range(1,50000000) ]

In [ ]:
%time for i in Lista: pass

In [ ]:
%time
for c in range(1, 50000000):
  pass
%time